# 1. Средствами языка Python сформировать текстовый файл (.txt), содержащий последовательность из целых положительных и
# отрицательных чисел. Сформировать новый текстовый файл (.txt) следующего вида, предварительно выполнив требуемую
# обработку элементов:
# Исходные данные:
# Количество элементов:
# Индекс последнего максимального элемента:
# Меняем местами первую и последнюю трети:
# 2. Из предложенного текстового файла (text18-9.txt) вывести на экран его содержимое, количество букв в нижнем
# регистре. Сформировать новый файл, в который поместить текст в стихотворной форме предварительно поставив последнюю
# строку фразой введенной пользователем.
