# 1. Средствами языка Python сформировать текстовый файл (.txt), содержащий последовательность из целых положительных и
# отрицательных чисел. Сформировать новый текстовый файл (.txt) следующего вида, предварительно выполнив требуемую
# обработку элементов:
# Исходные данные:
# Количество элементов:
# Индекс последнего максимального элемента:
# Меняем местами первую и последную трети:
# 2. Из предложенного текстового файла (text18-9.txt) вывести на экран его содержимое, количество  букв в нижнем
# регистре. Сформировать предварительно поставив последнуюю строку фразой выделеной пользователем.
